docs/math530/KBrefDiagonalMatrix.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-11 Sat 10:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Diagonal Matrix and Diagonalizability</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://taproot3.sanity.gq/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://taproot3.sanity.gq/theindex.html"> HOME </a>
</div><div id="content">
<h1 class="title">Diagonal Matrix and Diagonalizability</h1>
<div id="outline-container-org665cc94" class="outline-2">
<h2 id="org665cc94"><span class="section-number-2">1</span> diagonal matrix&#xa0;&#xa0;&#xa0;<span class="tag"><span class="def">def</span></span></h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
A <i>diagonal matrix</i> is a square matrix that is zero everywhere except possibly along the <a href="KBrefDiagonalOfAMatrix.html">diagonal</a>.
</p>
</blockquote>
</div>
<div id="outline-container-orga5f95a7" class="outline-3">
<h3 id="orga5f95a7"><span class="section-number-3">1.1</span> results</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org48b8578" class="outline-4">
<h4 id="org48b8578"><span class="section-number-4">1.1.1</span> every diagonal matrix is upper triangular</h4>
</div>
</div>
</div>
<div id="outline-container-org0a50688" class="outline-2">
<h2 id="org0a50688"><span class="section-number-2">2</span> diagonalizable&#xa0;&#xa0;&#xa0;<span class="tag"><span class="def">def</span></span></h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
An operator \(T \in  \mathcal{L} (V)\) is called <i>diagonalizable</i> if the operator has a diagonal matrix with respect to some basis of \(V\).
</p>
</blockquote>
</div>
<div id="outline-container-org535a07a" class="outline-3">
<h3 id="org535a07a"><span class="section-number-3">2.1</span> results</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org4735d41" class="outline-4">
<h4 id="org4735d41"><span class="section-number-4">2.1.1</span> Axler5.41 conditions equivalent to diagonalizability</h4>
<div class="outline-text-4" id="text-2-1-1">
<blockquote>
<p>
Suppose \(V\) is finite-dimensional  and \(T \in  \mathcal{L} (V)\). Let \(\lambda_1, \ldots, \lambda_m\) denote the distinct eigenvalues of \(T\). Then the following are equivalent:
</p>
<ol class="org-ol">
<li>\(T\) is diagonalizable</li>
<li>\(V\) has a basis consisting of eigenvalues of \(T\)</li>
<li>there exist 1-dimensional subspaces \(U_1, \ldots, U_n\) of \(V\), each invariant under \(T\), s.t.</li>
</ol>
<p>
\[\begin{aligned}
    V = U_1 \oplus \cdots \oplus U_n
	\end{aligned}\]
</p>
<ol class="org-ol">
<li>\(V = E(\lambda_1, T) \oplus \cdots \oplus E(\lambda_m, T)\) (\(V\) is the (direct) sum of eigenspaces)</li>
<li>\(\odim V = \odim E(\lambda_1, T) + \cdots + \odim E(\lambda_m, T)\)</li>
</ol>
</blockquote>
</div>
</div>
<div id="outline-container-org06cf52f" class="outline-4">
<h4 id="org06cf52f"><span class="section-number-4">2.1.2</span> Axler5.44 Enough eigenvalues implies diagonalizability</h4>
<div class="outline-text-4" id="text-2-1-2">
<blockquote>
<p>
If \(T\in \mathcal{L} (V)\) has \(\odim V\) distinct eigenvalues, then \(T\) is diagonalizable.
</p>
</blockquote>
</div>
<ol class="org-ol">
<li><a id="org67dd64d"></a>intuition<br />
<div class="outline-text-5" id="text-2-1-2-1">
<p>
Because distinct eigenvalues correspond to linearly independent eigenvectors, so there will be enough linearly independent eigenvecs to form a basis and thus a diagonal matrix.
</p>

<p>
In fact, we just need the geometric multiplicities to add up (a result Axler promises in later chapters)
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org89b2ec8" class="outline-4">
<h4 id="org89b2ec8"><span class="section-number-4">2.1.3</span> Relationship to non-diagonal matrix (in class 31 March 2021)</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Suppose \(A\) is the original map (not diagonal), and that \(P\) is the matrix where each column is an eigenvector written in terms of the original basis (standard basis, usually). Then
\[\begin{aligned}
    AP = PD
	\end{aligned}\]
where \(D\) is the diagonal matrix.
</p>
</div>
<ol class="org-ol">
<li><a id="org73c31c7"></a>this (or a conjugation??) forms a similarity transform, which is a type of equivalence relation<br />
<div class="outline-text-5" id="text-2-1-3-1">
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="namedate"><p class="subtitle"><span class="author">Taproot</span><span class="date">2021-09-11 Sat 09:29</span></p></div><div class="taprootcopyright">(c) 2021 Houjun Liu, Huxley Marvit, Zachary Sayyah, Albert Huang, Dylan Wallace</div>
</div>
</body>
</html>
