docs/mathematics/linear_algebra/KBrefDiagonalMatrix.tex
% Created 2021-09-27 Mon 11:53
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\setlength{\parindent}{0pt}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{svg}
\usepackage{cancel}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\renewcommand{\tableofcontents}{}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{Diagonal Matrix and Diagonalizability}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={Diagonal Matrix and Diagonalizability},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{diagonal matrix\hfill{}\textsc{def}}
\label{sec:org87d368b}
\begin{quote}
A \emph{diagonal matrix} is a square matrix that is zero everywhere except possibly along the \href{KBrefDiagonalOfAMatrix.org}{diagonal}.
\end{quote}
\subsection{results}
\label{sec:orgf8e70e0}
\subsubsection{every diagonal matrix is upper triangular}
\label{sec:org0b7b18d}
\section{diagonalizable\hfill{}\textsc{def}}
\label{sec:org4917b43}
\begin{quote}
An operator \(T \in  \mathcal{L} (V)\) is called \emph{diagonalizable} if the operator has a diagonal matrix with respect to some basis of \(V\).
\end{quote}
\subsection{results}
\label{sec:orga5bac92}
\subsubsection{Axler5.41 conditions equivalent to diagonalizability}
\label{sec:org064e327}
\begin{quote}
Suppose \(V\) is finite-dimensional  and \(T \in  \mathcal{L} (V)\). Let \(\lambda_1, \ldots, \lambda_m\) denote the distinct eigenvalues of \(T\). Then the following are equivalent:
\begin{enumerate}
\item \(T\) is diagonalizable
\item \(V\) has a basis consisting of eigenvalues of \(T\)
\item there exist 1-dimensional subspaces \(U_1, \ldots, U_n\) of \(V\), each invariant under \(T\), s.t.
\end{enumerate}
\[\begin{aligned}
    V = U_1 \oplus \cdots \oplus U_n
	\end{aligned}\]
\begin{enumerate}
\item \(V = E(\lambda_1, T) \oplus \cdots \oplus E(\lambda_m, T)\) (\(V\) is the (direct) sum of eigenspaces)
\item \(\odim V = \odim E(\lambda_1, T) + \cdots + \odim E(\lambda_m, T)\)
\end{enumerate}
\end{quote}
\subsubsection{Axler5.44 Enough eigenvalues implies diagonalizability}
\label{sec:orgfca1f7c}
\begin{quote}
If \(T\in \mathcal{L} (V)\) has \(\odim V\) distinct eigenvalues, then \(T\) is diagonalizable.
\end{quote}
\begin{enumerate}
\item intuition
\label{sec:org41b990b}
Because distinct eigenvalues correspond to linearly independent eigenvectors, so there will be enough linearly independent eigenvecs to form a basis and thus a diagonal matrix.

In fact, we just need the geometric multiplicities to add up (a result Axler promises in later chapters)
\end{enumerate}
\subsubsection{Relationship to non-diagonal matrix (in class 31 March 2021)}
\label{sec:orge1f6a43}
Suppose \(A\) is the original map (not diagonal), and that \(P\) is the matrix where each column is an eigenvector written in terms of the original basis (standard basis, usually). Then
\[\begin{aligned}
    AP = PD
	\end{aligned}\]
where \(D\) is the diagonal matrix.
\begin{enumerate}
\item this (or a conjugation??) forms a similarity transform, which is a type of equivalence relation
\label{sec:orgc8e30fc}
\end{enumerate}
\end{document}
